OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic16/libdev/pic18lf4685.c
/*
 * This definitions of the PIC18LF4685 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:24:05 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#include <pic18lf4685.h>

//==============================================================================

__at(0x0D60) __sfr RXF6SIDH;
__at(0x0D60) volatile __RXF6SIDHbits_t RXF6SIDHbits;

__at(0x0D61) __sfr RXF6SIDL;
__at(0x0D61) volatile __RXF6SIDLbits_t RXF6SIDLbits;

__at(0x0D62) __sfr RXF6EIDH;
__at(0x0D62) volatile __RXF6EIDHbits_t RXF6EIDHbits;

__at(0x0D63) __sfr RXF6EIDL;
__at(0x0D63) volatile __RXF6EIDLbits_t RXF6EIDLbits;

__at(0x0D64) __sfr RXF7SIDH;
__at(0x0D64) volatile __RXF7SIDHbits_t RXF7SIDHbits;

__at(0x0D65) __sfr RXF7SIDL;
__at(0x0D65) volatile __RXF7SIDLbits_t RXF7SIDLbits;

__at(0x0D66) __sfr RXF7EIDH;
__at(0x0D66) volatile __RXF7EIDHbits_t RXF7EIDHbits;

__at(0x0D67) __sfr RXF7EIDL;
__at(0x0D67) volatile __RXF7EIDLbits_t RXF7EIDLbits;

__at(0x0D68) __sfr RXF8SIDH;
__at(0x0D68) volatile __RXF8SIDHbits_t RXF8SIDHbits;

__at(0x0D69) __sfr RXF8SIDL;
__at(0x0D69) volatile __RXF8SIDLbits_t RXF8SIDLbits;

__at(0x0D6A) __sfr RXF8EIDH;
__at(0x0D6A) volatile __RXF8EIDHbits_t RXF8EIDHbits;

__at(0x0D6B) __sfr RXF8EIDL;
__at(0x0D6B) volatile __RXF8EIDLbits_t RXF8EIDLbits;

__at(0x0D70) __sfr RXF9SIDH;
__at(0x0D70) volatile __RXF9SIDHbits_t RXF9SIDHbits;

__at(0x0D71) __sfr RXF9SIDL;
__at(0x0D71) volatile __RXF9SIDLbits_t RXF9SIDLbits;

__at(0x0D72) __sfr RXF9EIDH;
__at(0x0D72) volatile __RXF9EIDHbits_t RXF9EIDHbits;

__at(0x0D73) __sfr RXF9EIDL;
__at(0x0D73) volatile __RXF9EIDLbits_t RXF9EIDLbits;

__at(0x0D74) __sfr RXF10SIDH;
__at(0x0D74) volatile __RXF10SIDHbits_t RXF10SIDHbits;

__at(0x0D75) __sfr RXF10SIDL;
__at(0x0D75) volatile __RXF10SIDLbits_t RXF10SIDLbits;

__at(0x0D76) __sfr RXF10EIDH;
__at(0x0D76) volatile __RXF10EIDHbits_t RXF10EIDHbits;

__at(0x0D77) __sfr RXF10EIDL;
__at(0x0D77) volatile __RXF10EIDLbits_t RXF10EIDLbits;

__at(0x0D78) __sfr RXF11SIDH;
__at(0x0D78) volatile __RXF11SIDHbits_t RXF11SIDHbits;

__at(0x0D79) __sfr RXF11SIDL;
__at(0x0D79) volatile __RXF11SIDLbits_t RXF11SIDLbits;

__at(0x0D7A) __sfr RXF11EIDH;
__at(0x0D7A) volatile __RXF11EIDHbits_t RXF11EIDHbits;

__at(0x0D7B) __sfr RXF11EIDL;
__at(0x0D7B) volatile __RXF11EIDLbits_t RXF11EIDLbits;

__at(0x0D80) __sfr RXF12SIDH;
__at(0x0D80) volatile __RXF12SIDHbits_t RXF12SIDHbits;

__at(0x0D81) __sfr RXF12SIDL;
__at(0x0D81) volatile __RXF12SIDLbits_t RXF12SIDLbits;

__at(0x0D82) __sfr RXF12EIDH;
__at(0x0D82) volatile __RXF12EIDHbits_t RXF12EIDHbits;

__at(0x0D83) __sfr RXF12EIDL;
__at(0x0D83) volatile __RXF12EIDLbits_t RXF12EIDLbits;

__at(0x0D84) __sfr RXF13SIDH;
__at(0x0D84) volatile __RXF13SIDHbits_t RXF13SIDHbits;

__at(0x0D85) __sfr RXF13SIDL;
__at(0x0D85) volatile __RXF13SIDLbits_t RXF13SIDLbits;

__at(0x0D86) __sfr RXF13EIDH;
__at(0x0D86) volatile __RXF13EIDHbits_t RXF13EIDHbits;

__at(0x0D87) __sfr RXF13EIDL;
__at(0x0D87) volatile __RXF13EIDLbits_t RXF13EIDLbits;

__at(0x0D88) __sfr RXF14SIDH;
__at(0x0D88) volatile __RXF14SIDHbits_t RXF14SIDHbits;

__at(0x0D89) __sfr RXF14SIDL;
__at(0x0D89) volatile __RXF14SIDLbits_t RXF14SIDLbits;

__at(0x0D8A) __sfr RXF14EIDH;
__at(0x0D8A) volatile __RXF14EIDHbits_t RXF14EIDHbits;

__at(0x0D8B) __sfr RXF14EIDL;
__at(0x0D8B) volatile __RXF14EIDLbits_t RXF14EIDLbits;

__at(0x0D90) __sfr RXF15SIDH;
__at(0x0D90) volatile __RXF15SIDHbits_t RXF15SIDHbits;

__at(0x0D91) __sfr RXF15SIDL;
__at(0x0D91) volatile __RXF15SIDLbits_t RXF15SIDLbits;

__at(0x0D92) __sfr RXF15EIDH;
__at(0x0D92) volatile __RXF15EIDHbits_t RXF15EIDHbits;

__at(0x0D93) __sfr RXF15EIDL;
__at(0x0D93) volatile __RXF15EIDLbits_t RXF15EIDLbits;

__at(0x0DD4) __sfr RXFCON0;
__at(0x0DD4) volatile __RXFCON0bits_t RXFCON0bits;

__at(0x0DD5) __sfr RXFCON1;
__at(0x0DD5) volatile __RXFCON1bits_t RXFCON1bits;

__at(0x0DD8) __sfr SDFLC;
__at(0x0DD8) volatile __SDFLCbits_t SDFLCbits;

__at(0x0DE0) __sfr RXFBCON0;
__at(0x0DE0) volatile __RXFBCON0bits_t RXFBCON0bits;

__at(0x0DE1) __sfr RXFBCON1;
__at(0x0DE1) volatile __RXFBCON1bits_t RXFBCON1bits;

__at(0x0DE2) __sfr RXFBCON2;
__at(0x0DE2) volatile __RXFBCON2bits_t RXFBCON2bits;

__at(0x0DE3) __sfr RXFBCON3;
__at(0x0DE3) volatile __RXFBCON3bits_t RXFBCON3bits;

__at(0x0DE4) __sfr RXFBCON4;
__at(0x0DE4) volatile __RXFBCON4bits_t RXFBCON4bits;

__at(0x0DE5) __sfr RXFBCON5;
__at(0x0DE5) volatile __RXFBCON5bits_t RXFBCON5bits;

__at(0x0DE6) __sfr RXFBCON6;
__at(0x0DE6) volatile __RXFBCON6bits_t RXFBCON6bits;

__at(0x0DE7) __sfr RXFBCON7;
__at(0x0DE7) volatile __RXFBCON7bits_t RXFBCON7bits;

__at(0x0DF0) __sfr MSEL0;
__at(0x0DF0) volatile __MSEL0bits_t MSEL0bits;

__at(0x0DF1) __sfr MSEL1;
__at(0x0DF1) volatile __MSEL1bits_t MSEL1bits;

__at(0x0DF2) __sfr MSEL2;
__at(0x0DF2) volatile __MSEL2bits_t MSEL2bits;

__at(0x0DF3) __sfr MSEL3;
__at(0x0DF3) volatile __MSEL3bits_t MSEL3bits;

__at(0x0DF8) __sfr BSEL0;
__at(0x0DF8) volatile __BSEL0bits_t BSEL0bits;

__at(0x0DFA) __sfr BIE0;
__at(0x0DFA) volatile __BIE0bits_t BIE0bits;

__at(0x0DFC) __sfr TXBIE;
__at(0x0DFC) volatile __TXBIEbits_t TXBIEbits;

__at(0x0E20) __sfr B0CON;
__at(0x0E20) volatile __B0CONbits_t B0CONbits;

__at(0x0E21) __sfr B0SIDH;
__at(0x0E21) volatile __B0SIDHbits_t B0SIDHbits;

